In [1]:
from sqlalchemy import create_engine, text

In [2]:
database_name = 'scooters'   

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"
connection_string

'postgresql://postgres:postgres@localhost:5432/scooters'

In [3]:
engine = create_engine(connection_string)

In [4]:
engine

Engine(postgresql://postgres:***@localhost:5432/scooters)

In [5]:
query = '''
SELECT *
FROM trips
LIMIT 10;
'''

with engine.connect() as connection:
    result = connection.execute(text(query))

In [6]:
result.fetchone()

(datetime.datetime(2019, 5, 1, 0, 0, 55, 423000), 'Bird', 'BRD2134', 'Powered9EAJL', Decimal('3.0'), Decimal('958.00528'), datetime.date(2019, 5, 1), datetime.time(0, 0, 20, 460000), datetime.date(2019, 5, 1), datetime.time(0, 2, 52, 346666), Decimal('36.1571'), Decimal('-86.8036'), Decimal('36.1566'), Decimal('-86.8067'), '[(36.157235, -86.803612), (36.157235, -86.80362), (36.157226, -86.803642), (36.157226, -86.803665), (36.157226, -86.803665), (36.157226, -86.803665), ... (2204 characters truncated) ... (36.155941, -86.809517), (36.155941, -86.809517), (36.155941, -86.809517), (36.155918, -86.809671), (36.155918, -86.809671), (36.155918, -86.809671)]', datetime.datetime(2019, 5, 2, 5, 30, 23, 780000))

In [7]:
result.fetchall()

[(datetime.datetime(2019, 5, 1, 0, 3, 33, 147000), 'Lyft', 'LFT5', 'Powered296631', Decimal('1.7156'), Decimal('1371.39112'), datetime.date(2019, 5, 1), datetime.time(0, 1, 50, 90000), datetime.date(2019, 5, 1), datetime.time(0, 3, 33, 26666), Decimal('36.15797'), Decimal('-86.77896'), Decimal('36.16054'), Decimal('-86.77689'), '[(36.15797, -86.77896), (36.15795, -86.77873), (36.15798, -86.77859), (36.15809, -86.77822), (36.15825, -86.77785), (36.1583, -86.77768), (36.15838,  ... (92 characters truncated) ... -86.77703), (36.15963, -86.77678), (36.15977, -86.77665), (36.15994, -86.77654), (36.16024, -86.77673), (36.16053, -86.77694), (36.16054, -86.77689)]', datetime.datetime(2019, 5, 2, 7, 20, 32, 757000)),
 (datetime.datetime(2019, 5, 1, 0, 5, 55, 570000), 'Bird', 'BRD2168', 'Powered7S2UU', Decimal('3.0'), Decimal('2296.588'), datetime.date(2019, 5, 1), datetime.time(0, 3, 47, 363333), datetime.date(2019, 5, 1), datetime.time(0, 7, 13, 596666), Decimal('36.1547'), Decimal('-86.7818'), Decimal('36.1565'), Decimal('-86.7868'), '[(36.155068, -86.782124), (36.156597, -86.78675)]', datetime.datetime(2019, 5, 2, 5, 30, 24, 530000)),
 (datetime.datetime(2019, 5, 1, 0, 5, 55, 570000), 'Bird', 'BRD2166', 'PoweredZIIVX', Decimal('3.0'), Decimal('1200.78744'), datetime.date(2019, 5, 1), datetime.time(0, 4, 21, 386666), datetime.date(2019, 5, 1), datetime.time(0, 6, 59, 176666), Decimal('36.1494'), Decimal('-86.7795'), Decimal('36.1531'), Decimal('-86.7796'), '[(36.149741, -86.779344), (36.149741, -86.779327), (36.149741, -86.779327), (36.149741, -86.779327), (36.149761, -86.77929), (36.149761, -86.77929),  ... (1433 characters truncated) ... , (36.153076, -86.779496), (36.153076, -86.779496), (36.153088, -86.77951), (36.153088, -86.77951), (36.153103, -86.779519), (36.153103, -86.779519)]', datetime.datetime(2019, 5, 2, 5, 30, 24, 237000)),
 (datetime.datetime(2019, 5, 1, 0, 5, 55, 570000), 'Bird', 'BRD2165', 'PoweredJ7MB3', Decimal('2.0'), Decimal('351.04988'), datetime.date(2019, 5, 1), datetime.time(0, 4, 27, 796666), datetime.date(2019, 5, 1), datetime.time(0, 6, 23, 150000), Decimal('36.1778'), Decimal('-86.7866'), Decimal('36.1774'), Decimal('-86.7876'), '[(36.177699, -86.786477), (36.177711, -86.786469), (36.177715, -86.786469), (36.177715, -86.786469), (36.177715, -86.786469), (36.177753, -86.786469) ... (885 characters truncated) ... ), (36.17741, -86.787652), (36.177383, -86.78775), (36.177383, -86.78775), (36.177383, -86.787766), (36.177383, -86.787766), (36.177383, -86.787766)]', datetime.datetime(2019, 5, 2, 5, 30, 24, 207000)),
 (datetime.datetime(2019, 5, 1, 0, 5, 55, 570000), 'Bird', 'BRD2167', 'PoweredEJF1K', Decimal('3.0'), Decimal('984.252'), datetime.date(2019, 5, 1), datetime.time(0, 3, 56, 546666), datetime.date(2019, 5, 1), datetime.time(0, 6, 45, 786666), Decimal('36.1544'), Decimal('-86.7862'), Decimal('36.1515'), Decimal('-86.7844'), '[(36.154368, -86.785909), (36.151689, -86.784331), (36.151619, -86.784294), (36.151562, -86.784313)]', datetime.datetime(2019, 5, 2, 5, 30, 24, 317000)),
 (datetime.datetime(2019, 5, 1, 0, 7, 55, 880000), 'Lyft', 'LFT10', 'Powered329418', Decimal('1.0939166667'), Decimal('0.0'), datetime.date(2019, 5, 1), datetime.time(0, 6, 50, 106666), datetime.date(2019, 5, 1), datetime.time(0, 7, 55, 740000), Decimal('36.15168'), Decimal('-86.78408'), Decimal('36.15171'), Decimal('-86.78411'), '[(36.15168, -86.78408), (36.15171, -86.78411)]', datetime.datetime(2019, 5, 2, 7, 20, 32, 890000)),
 (datetime.datetime(2019, 5, 1, 0, 10, 50, 240000), 'Lyft', 'LFT13', 'Powered438572', Decimal('2.9543833333'), Decimal('1161.41736'), datetime.date(2019, 5, 1), datetime.time(0, 7, 52, 853333), datetime.date(2019, 5, 1), datetime.time(0, 10, 50, 116666), Decimal('36.15193'), Decimal('-86.78439'), Decimal('36.15463'), Decimal('-86.78492'), '[(36.15193, -86.78439), (36.15188, -86.78432), (36.15186, -86.78425), (36.15199, -86.78421), (36.15207, -86.78412), (36.15219, -86.78404), (36.15233, ... (203 characters truncated) ... 4, -86.78436), (36.15392, -86.78445), (36.15405, -86.7846), (36.15427, -86.78473), (36.1545, -86.78487), (36.1546, -86.78491), (36.15463, -86.78492)]', datetime.datetime(2019, 5, 2, 7, 20, 32, 990000)),
 (datetime.datetime(2019, 5, 1, 0, 10, 56, 13000), 'Bird', 'BRD2193', 'PoweredSX2AW', Decimal('6.0'), Decimal('2624.672'), datetime.date(2019, 5, 1), datetime.time(0, 6, 34, 436666), datetime.date(2019, 5, 1), datetime.time(0, 12, 48, 676666), Decimal('36.1708'), Decimal('-86.7893'), Decimal('36.1746'), Decimal('-86.786'), '[(36.170995, -86.789593), (36.173193, -86.791207), (36.174235, -86.787287), (36.174353, -86.787131), (36.174687, -86.785989), (36.174634, -86.78593), (36.174676, -86.785968), (36.174864, -86.786073)]', datetime.datetime(2019, 5, 2, 5, 30, 24, 833000)),
 (datetime.datetime(2019, 5, 1, 0, 10, 56, 13000), 'Bird', 'BRD2194', 'PoweredL968V', Decimal('6.0'), Decimal('2624.672'), datetime.date(2019, 5, 1), datetime.time(0, 5, 36, 870000), datetime.date(2019, 5, 1), datetime.time(0, 11, 19, 183333), Decimal('36.1565'), Decimal('-86.7971'), Decimal('36.1512'), Decimal('-86.7968'), '[(36.15654, -86.797137), (36.153065, -86.798047), (36.151263, -86.796712)]', datetime.datetime(2019, 5, 2, 5, 30, 24, 920000))]

In [8]:
import pandas as pd

In [9]:
with engine.connect() as connection:
    trips = pd.read_sql(text(query), con = connection)

trips.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.0000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.7156,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.0000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.0000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.0000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207

In [10]:
with engine.connect() as connection:
    scooters = pd.read_sql(text(query), con = connection)

scooters.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.0000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.7156,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.0000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.0000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.0000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207

In [11]:
scooters.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 16 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   pubtimestamp    10 non-null     datetime64[ns]
 1   companyname     10 non-null     object
 2   triprecordnum   10 non-null     object
 3   sumdid          10 non-null     object
 4   tripduration    10 non-null     float64
 5   tripdistance    10 non-null     float64
 6   startdate       10 non-null     object
 7   starttime       10 non-null     object
 8   enddate         10 non-null     object
 9   endtime         10 non-null     object
 10  startlatitude   10 non-null     float64
 11  startlongitude  10 non-null     float64
 12  endlatitude     10 non-null     float64
 13  endlongitude    10 non-null     float64
 14  triproute       10 non-null     object
 15  create_dt       10 non-null     datetime64[ns]
dtypes: datetime64[ns](2), float64(6), object(8)
memory usage: 1.4+ KB

query = '''
SELECT *
FROM scooters
WHERE companyname = 'Bird'
'''

with engine.connect() as connection:
    bird = pd.read_sql(text(query), con = connection)

bird.head()

query = '''
SELECT *
FROM scooters
WHERE companyname = 'Bolt'
'''

with engine.connect() as connection:
    bolt = pd.read_sql(text(query), con = connection)

bolt.head()

query = '''
SELECT *
FROM scooters
WHERE companyname = 'Gotcha'
'''

with engine.connect() as connection:
    gotcha = pd.read_sql(text(query), con = connection)

gotcha.head()

query = '''
SELECT *
FROM scooters
WHERE companyname = 'Jump'
'''

with engine.connect() as connection:
    jump = pd.read_sql(text(query), con = connection)

jump.head()

query = '''
SELECT *
FROM scooters
WHERE companyname = 'Lime'
'''

with engine.connect() as connection:
    lime = pd.read_sql(text(query), con = connection)

lime.head()

query = '''
SELECT *
FROM scooters
WHERE companyname = 'Lyft'
'''

with engine.connect() as connection:
    lyft = pd.read_sql(text(query), con = connection)

lyft.head()

In [12]:
birddf = pd.read_csv('../data/birddf.csv')

In [13]:
birddf.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:37:28.870,36.141562,-86.806655,PoweredVAW9Y,Powered,95.0,scooter,0.15,Bird
1,2019-07-30 17:37:28.870,36.159744,-86.780067,PoweredSNB79,Powered,58.0,scooter,0.15,Bird
2,2019-07-30 17:37:28.870,36.153569,-86.784961,PoweredZY5KX,Powered,100.0,scooter,0.15,Bird
3,2019-07-30 17:37:28.870,36.155984,-86.782756,PoweredPHVAG,Powered,100.0,scooter,0.15,Bird
4,2019-07-30 17:37:28.870,36.147253,-86.815000,Powered238ZE,Powered,76.0,scooter,0.15,Bird

In [14]:
boltdf = pd.read_csv('../data/boltdf.csv')

In [15]:
boltdf.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:34:09,36.158986,-86.777469,Powered-a5530bc9-d4c0-7ad4-7e21-87bcca195865,Powered,65.71,Scooter,0.3,Bolt
1,2019-07-30 17:34:09,36.165869,-86.777765,Powered-751e19ec-b697-a51f-04ea-0bf9a2e125c9,Powered,69.41,Scooter,0.3,Bolt
2,2019-07-30 17:34:09,36.149978,-86.814553,Powered-f4909631-d138-c9ee-cbec-8efc5568b77d,Powered,67.99,Scooter,0.3,Bolt
3,2019-07-30 17:34:09,36.163135,-86.775989,Powered-601cf2bd-1750-3e32-c23a-aabc76b61d65,Powered,94.39,Scooter,0.3,Bolt
4,2019-07-30 17:34:09,36.150896,-86.804663,Powered-4aede0e0-a137-ca41-680e-c9c6b8a54fa9,Powered,99.49,Scooter,0.3,Bolt

In [16]:
gotchadf = pd.read_csv('../data/gotchadf.csv')

In [17]:
gotchadf.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 22:53:32.163,33.792620,-84.402760,Powered2460,Powered,47.0,Scooter,0.15,Gotcha
1,2019-07-30 22:53:32.163,36.121395,-86.769998,Powered775,Powered,0.0,Scooter,0.15,Gotcha
2,2019-07-30 22:53:32.163,36.121441,-86.769995,Powered794,Powered,0.0,Scooter,0.15,Gotcha
3,2019-07-30 22:53:32.163,33.792609,-84.402744,Powered2503,Powered,27.0,Scooter,0.15,Gotcha
4,2019-07-30 22:53:32.163,36.121265,-86.770278,Powered1913,Powered,32.0,Scooter,0.15,Gotcha

In [18]:
jumpdf = pd.read_csv('../data/jumpdf.csv')

In [19]:
jumpdf.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:33:42,36.1195,-86.7534,Powered997dfabc-4fa3-557c-989c-33da0d096d6b,Powered,65.0,scooter,0.06,Jump
1,2019-07-30 17:33:42,36.1199,-86.7534,Poweredba213730-5704-5625-af7f-31c34d960b66,Powered,4.0,scooter,0.06,Jump
2,2019-07-30 17:33:42,36.1199,-86.7533,Poweredd6e29e2c-0f61-57ac-8237-5854332b595f,Powered,3.0,scooter,0.06,Jump
3,2019-07-30 17:33:42,36.1202,-86.7533,Powered7a0a9782-2e7b-5282-9d10-cbe0750c703e,Powered,0.0,scooter,0.06,Jump
4,2019-07-30 17:33:42,36.1199,-86.7534,Powered0d329ae3-b18b-5e2a-9f3f-c2d91679c324,Powered,3.0,scooter,0.06,Jump

In [20]:
limedf = pd.read_csv('../data/limedf.csv')

In [21]:
limedf.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:35:18.710,36.182537,-86.793612,PoweredUD5AZXJ5UMT7B,Powered,75.0,scooter,0.15,Lime
1,2019-07-30 17:35:18.710,36.191159,-86.795243,PoweredEP7AKU3H6GPPG,Powered,38.0,scooter,0.15,Lime
2,2019-07-30 17:35:18.710,36.177788,-86.777875,PoweredSINZNV4OYDROU,Powered,47.0,scooter,0.15,Lime
3,2019-07-30 17:35:18.710,36.182087,-86.735612,Powered6PLOLGBTHDPWE,Powered,55.0,scooter,0.15,Lime
4,2019-07-30 17:35:18.710,36.177627,-86.777723,Powered5R3YEGGZITMVT,Powered,68.0,scooter,0.15,Lime

In [22]:
lyftdf = pd.read_csv('../data/lyftdf.csv')

In [23]:
lyftdf.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:34:49.530,36.135925,-86.767207,Powered788160,Powered,48.0,scooter,0.15,Lyft
1,2019-07-30 17:55:09.643,36.162249,-86.790378,Powered334889,Powered,86.0,scooter,0.15,Lyft
2,2019-07-30 17:34:49.677,36.143064,-86.802958,Powered266526,Powered,17.0,scooter,0.15,Lyft
3,2019-07-30 17:34:49.700,36.177629,-86.777725,Powered876748,Powered,66.0,scooter,0.15,Lyft
4,2019-07-30 17:55:09.663,36.145882,-86.816281,Powered037286,Powered,95.0,scooter,0.15,Lyft

In [24]:
spindf = pd.read_csv('../data/spindf.csv')

In [25]:
spindf.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:35:06.990,36.14528,-86.80569,Powered7049691,Powered,92.0,Scooter,0.23,Spin
1,2019-07-30 17:35:06.990,36.16017,-86.77848,Powered8631385,Powered,91.0,Scooter,0.23,Spin
2,2019-07-30 17:35:06.990,36.15249,-86.79480,Powered1741740,Powered,91.0,Scooter,0.23,Spin
3,2019-07-30 17:35:06.990,36.15947,-86.78826,Powered3114843,Powered,78.0,Scooter,0.23,Spin
4,2019-07-30 17:35:06.990,36.16382,-86.77891,Powered8546104,Powered,85.0,Scooter,0.23,Spin

In [26]:
tripsdf = pd.read_csv('../data/tripsdf.csv')

In [27]:
tripsdf.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.0000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.7156,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.0000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.0000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.0000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207

In [28]:
scooters_list = [birddf, boltdf, gotchadf, jumpdf, limedf, lyftdf, spindf]

In [32]:
scootersdf = pd.concat(scooters_list)

In [33]:
scootersdf.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:37:28.870,36.141562,-86.806655,PoweredVAW9Y,Powered,95.0,scooter,0.15,Bird
1,2019-07-30 17:37:28.870,36.159744,-86.780067,PoweredSNB79,Powered,58.0,scooter,0.15,Bird
2,2019-07-30 17:37:28.870,36.153569,-86.784961,PoweredZY5KX,Powered,100.0,scooter,0.15,Bird
3,2019-07-30 17:37:28.870,36.155984,-86.782756,PoweredPHVAG,Powered,100.0,scooter,0.15,Bird
4,2019-07-30 17:37:28.870,36.147253,-86.815000,Powered238ZE,Powered,76.0,scooter,0.15,Bird

In [34]:
scootersdf.isna().any()

pubdatetime    False
latitude       False
longitude      False
sumdid         False
sumdtype       False
chargelevel     True
sumdgroup      False
costpermin     False
companyname    False
dtype: bool

In [35]:
tripsdf.isna().any()

pubtimestamp      False
companyname       False
triprecordnum     False
sumdid            False
tripduration      False
tripdistance      False
startdate         False
starttime         False
enddate           False
endtime           False
startlatitude     False
startlongitude    False
endlatitude       False
endlongitude      False
triproute         False
create_dt         False
dtype: bool

# chargelevel column in scootersdf has some null values

In [36]:
scootersdf.info()

<class 'pandas.core.frame.DataFrame'>
Index: 73414043 entries, 0 to 5559572
Data columns (total 9 columns):
 #   Column       Dtype
---  ------       -----
 0   pubdatetime  object
 1   latitude     float64
 2   longitude    float64
 3   sumdid       object
 4   sumdtype     object
 5   chargelevel  float64
 6   sumdgroup    object
 7   costpermin   float64
 8   companyname  object
dtypes: float64(4), object(5)
memory usage: 5.5+ GB

In [37]:
tripsdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 565522 entries, 0 to 565521
Data columns (total 16 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   pubtimestamp    565522 non-null  object
 1   companyname     565522 non-null  object
 2   triprecordnum   565522 non-null  object
 3   sumdid          565522 non-null  object
 4   tripduration    565522 non-null  float64
 5   tripdistance    565522 non-null  float64
 6   startdate       565522 non-null  object
 7   starttime       565522 non-null  object
 8   enddate         565522 non-null  object
 9   endtime         565522 non-null  object
 10  startlatitude   565522 non-null  float64
 11  startlongitude  565522 non-null  float64
 12  endlatitude     565522 non-null  float64
 13  endlongitude    565522 non-null  float64
 14  triproute       565522 non-null  object
 15  create_dt       565522 non-null  object
dtypes: float64(6), object(10)
memory usage: 69.0+ MB

In [46]:
scootersdf['pubdatetime'] = pd.to_datetime(scootersdf['pubdatetime'], dayfirst = False, format = 'mixed')

In [47]:
scootersdf.info()

<class 'pandas.core.frame.DataFrame'>
Index: 73414043 entries, 0 to 5559572
Data columns (total 9 columns):
 #   Column       Dtype
---  ------       -----
 0   pubdatetime  datetime64[ns]
 1   latitude     float64
 2   longitude    float64
 3   sumdid       object
 4   sumdtype     object
 5   chargelevel  float64
 6   sumdgroup    object
 7   costpermin   float64
 8   companyname  object
dtypes: datetime64[ns](1), float64(4), object(4)
memory usage: 5.5+ GB

In [48]:
scootersdf.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:37:28.870,36.141562,-86.806655,PoweredVAW9Y,Powered,95.0,scooter,0.15,Bird
1,2019-07-30 17:37:28.870,36.159744,-86.780067,PoweredSNB79,Powered,58.0,scooter,0.15,Bird
2,2019-07-30 17:37:28.870,36.153569,-86.784961,PoweredZY5KX,Powered,100.0,scooter,0.15,Bird
3,2019-07-30 17:37:28.870,36.155984,-86.782756,PoweredPHVAG,Powered,100.0,scooter,0.15,Bird
4,2019-07-30 17:37:28.870,36.147253,-86.815000,Powered238ZE,Powered,76.0,scooter,0.15,Bird

In [49]:
tripsdf['pubtimestamp'] = pd.to_datetime(tripsdf['pubtimestamp'], dayfirst = False, format = 'mixed')

In [50]:
tripsdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 565522 entries, 0 to 565521
Data columns (total 16 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   pubtimestamp    565522 non-null  datetime64[ns]
 1   companyname     565522 non-null  object
 2   triprecordnum   565522 non-null  object
 3   sumdid          565522 non-null  object
 4   tripduration    565522 non-null  float64
 5   tripdistance    565522 non-null  float64
 6   startdate       565522 non-null  object
 7   starttime       565522 non-null  object
 8   enddate         565522 non-null  object
 9   endtime         565522 non-null  object
 10  startlatitude   565522 non-null  float64
 11  startlongitude  565522 non-null  float64
 12  endlatitude     565522 non-null  float64
 13  endlongitude    565522 non-null  float64
 14  triproute       565522 non-null  object
 15  create_dt       565522 non-null  object
dtypes: datetime64[ns](1), float64(6), object(9)
memory usage: 69.0+ MB

In [51]:
tripsdf.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.0000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.7156,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.0000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.0000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.0000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207

In [55]:
scooters_date_range = str(scootersdf['pubdatetime'].dt.date.min()) + ' to ' +str(scootersdf['pubdatetime'].dt.date.max())

In [56]:
scooters_date_range

'2019-05-01 to 2019-07-31'

In [57]:
trips_date_range = str(tripsdf['pubtimestamp'].dt.date.min()) + ' to ' +str(tripsdf['pubtimestamp'].dt.date.max())

In [58]:
trips_date_range

'2019-05-01 to 2019-08-01'

# trips table goes into August

# times for both tables are in 24 hour values

In [62]:
scootersdf.sumdgroup.unique()

array(['scooter', 'Scooter', 'bicycle'], dtype=object)

# bicycle isn't necesssary for this project

In [64]:
print(scootersdf['latitude'].min())
print(scootersdf['latitude'].max())

0.0
3609874.116666

In [69]:
print(scootersdf['longitude'].min())
print(scootersdf['longitude'].max())

-97.443879
0.0

In [65]:
print(tripsdf['startlatitude'].min())
print(tripsdf['startlatitude'].max())

35.8532
36.300029

In [66]:
print(tripsdf['endlatitude'].min())
print(tripsdf['endlatitude'].max())

-36.850405
51.045409

In [67]:
print(tripsdf['startlongitude'].min())
print(tripsdf['startlongitude'].max())

-86.918008
-86.3662

In [68]:
print(tripsdf['endlongitude'].min())
print(tripsdf['endlongitude'].max())

-122.673729
174.764886

In [70]:
print(tripsdf['tripdistance'].min())
print(tripsdf['tripdistance'].max())

-20324803.8
31884482.6476

# the negative min value doesn't make sense and the max value seems extremely high

In [71]:
print(tripsdf['tripduration'].min())
print(tripsdf['tripduration'].max())

-19.3582666667
512619.0

# again the negative min value doesn't make sense and the max value is again too high

In [73]:
tripsdf['companyname'].value_counts()

companyname
Lime             225694
Bird             152745
Lyft             120991
SPIN              34450
Bolt Mobility     21890
JUMP               6437
Gotcha             3315
Name: count, dtype: int64

In [74]:
scootersdf['companyname'].value_counts()

companyname
Jump      21835098
Lime      16524261
Bird      12251590
Lyft       9087043
Spin       5559573
Gotcha     4679280
Bolt       3477198
Name: count, dtype: int64

# 1. During this period, seven companies offered scooters. How many scooters did each company have in this time frame? Did the number for each company change over time? Did scooter usage vary by company?

In [79]:
company_scooters = scootersdf[['companyname', 'sumdid']].groupby(['companyname'])['sumdid']\
                                                        .nunique()\
                                                        .reset_index(name = 'count')\
                                                        .sort_values(['count'])

In [81]:
company_scooters

  companyname  count
2      Gotcha    224
1        Bolt    360
6        Spin    805
3        Jump   1210
5        Lyft   1735
4        Lime   1824
0        Bird   3860

In [89]:
(scootersdf
 .assign(month = scootersdf['pubdatetime'].dt.month_name())
 .month
 .value_counts(sort = False)
)

month
July    25075445
May     20292503
June    28046095
Name: count, dtype: int64